Repository: AlexanderYunker1983/MiniCAM
Catalog: MiniCAM.Core/Localization/Resources.*.resx
Languages: ru

source: Welcome
ru: Добро пожаловать

# MenuSettings
source: Settings
ru: Настройки

# MenuApplicationSettings
source: Application Settings
ru: Настройки приложения

# MenuCodeGenerationSettings
source: Code Generation Settings
ru: Настройки генерации кода

# RibbonTabDrilling
source: Drilling
ru: Сверление

# RibbonTabPocket
source: Pocket
ru: Карман

# RibbonTabProfile
source: Profile
ru: Профиль

# RibbonTabOther
source: Other
ru: Другое

# ApplicationSettingsTitle
source: Application settings
ru: Настройки приложения

# LanguageLabel
source: Application language
ru: Язык приложения

# ButtonApply
source: Apply
ru: Применить

# ButtonReset
source: Reset changes
ru: Сбросить изменения

# LanguageAuto
source: Auto (system)
ru: Авто (системный)

# LanguageEnglish
source: English
ru: Английский

# LanguageRussian
source: Russian
ru: Русский

# ThemeLabel
source: Application theme
ru: Тема приложения

# ThemeAuto
source: System
ru: Системная

# ThemeLight
source: Light
ru: Светлая

# ThemeDark
source: Dark
ru: Тёмная

# CodeGenerationSettingsTitle
source: Settings
ru: Настройки

# TabCodeGeneration
source: Code Generation
ru: Генерация кода

# TabSpindle
source: Spindle
ru: Шпиндель

# TabCoolant
source: Coolant
ru: СОЖ

# CoolantAddCode
source: Add coolant control code
ru: Добавлять код управления СОЖ

# CoolantEnableAtStart
source: Enable coolant at program start (M8)
ru: Включать СОЖ в начале программы (М8)

# CoolantDisableAtEnd
source: Disable coolant at program end (M9)
ru: Выключать СОЖ в конце программы (М9)

# SpindleAddCode
source: Add spindle control code
ru: Добавлять код управления шпинделем

# SpindleSetSpeed
source: Set spindle speed
ru: Устанавливать скорость шпинделя

# SpindleSpeedLabel
source: Spindle rotation speed, rpm
ru: Скорость вращения шпинделя, об/мин

# SpindleEnableBeforeOperations
source: Enable spindle before operations
ru: Включать шпиндель перед операциями

# SpindleEnableCommandLabel
source: Enable command
ru: Команда включения

# SpindleEnableCommandM3
source: M3
ru: М3

# SpindleEnableCommandM4
source: M4
ru: М4

# SpindleAddDelayAfterEnable
source: Add delay after enable (G4)
ru: Добавлять задержку после включения (G4)

# SpindleDelayParameterLabel
source: Delay parameter
ru: Параметр задержки

# SpindleDelayValueLabel
source: Parameter value
ru: Величина параметра

# SpindleDisableAfterOperations
source: Disable spindle after operations (M5)
ru: Выключать шпиндель после операций (М5)

# CodeGenUseLineNumbers
source: Use line numbers (N...)
ru: Использовать номера строк (N...)

# CodeGenStartLineNumber
source: Start line number
ru: Начальный номер строки

# CodeGenLineNumberStep
source: Line number step
ru: Шаг номера строки

# CodeGenGenerateComments
source: Generate comments
ru: Генерировать комментарии

# CodeGenAllowArcs
source: Allow arcs (G2/G3)
ru: Разрешить дуги (G2/G3)

# CodeGenFormatCommands
source: Format commands G01/G00 instead of G1/G0
ru: Формат команд G01/G00 вместо G1/G0

# CodeGenSetWorkCoordinateSystem
source: Set work coordinate system at program start
ru: Устанавливать рабочую систему координат в начале программы

# CodeGenCoordinateSystemLabel
source: Coordinate system
ru: Система координат

# CodeGenSetAbsoluteCoordinates
source: Set absolute coordinate system G90
ru: Устанавливать абсолютную систему координат G90

# CodeGenAllowRelativeCoordinates
source: Allow relative coordinate system within individual operations (G91)
ru: Разрешить использование относительной системы координат внутри отдельных операций (G91)

# CodeGenSetZerosAtStart
source: Set zeros at program start (G92)
ru: В начале программы выполнить установку нулей (G92)

# CodeGenMoveToPointAtEnd
source: Move to point at program end
ru: В конце программы перейти в точку

source: Operation Properties
ru: Свойства операции

# Preview2D
source: 2D Preview
ru: 2D-предпросмотр

source: Operations List
ru: Список операций
